# Taps
tap 'homebrew/cask'
# tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle' # To be able to use run `brew bundle` to install all apps - https://medium.com/@satorusasozaki/automate-mac-os-x-configuration-by-using-brewfile-58a78ce5cc53

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Improved cat command
brew 'commitizen' # Conventional commit helper
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh' # GitHub CLI
brew 'git'
brew 'grep'
# brew 'httpie'
brew 'jq' # JSON parser, Used for spatie/visit?
brew 'mackup' # Backup and restore app settings on macOS
brew 'mas' # Mac App Store manager
brew 'ncdu' # Disk usage analyzer
# brew 'readine'
# brew 'svn' # Needed to install fonts
brew 'tree' # Display directories as trees 
brew 'wget' # Download files from the web
brew 'xz' # General-purpose data compression with high compression ratio
brew 'zsh'

# Development
cask 'adoptopenjdk' # Java JDK
# brew 'direnv' # Load/unload environment variables based on current directory
brew 'imagemagick' # Image processing library
brew 'openssl'
# brew 'pyenv' # Python version manager

# Apps
# Download Tinker tool to speed up animations and more - https://www.bresink.com/osx/TinkerTool.html
# cask 'discord'
# cask 'docker'
# cask 'figma'
# cask 'slack'
# cask 'visual-studio-code'
# cask 'zoom'
# cask 'spotify'
# cask 'notion'
# cask 'postman'
# cask 'fig'
cask 'github'
# cask 'hyper' # Terminal
# cask 'deepl'
# cask 'linear-linear'
# cask 'arc'
# cask 'cleanmymac'
# cask 'backblaze' # Backup files to the cloud
# cask 'devcleaner' # Remove Xcode caches and unused simulators
# cask 'dbeaver-community'
# cask 'nordvpn'
# cask 'nordpass'
# cask 'raycast'
# cask 'typora' # Markdown editor
# cask 'whatsapp'
# cask 'android-studio'
# cask 'google-chrome'
# cask 'bartender' # Organize menu bar icons
# cask 'hazeover' # Dim background windows to focus on the front window

# Quicklook
# cask 'qlmarkdown' # $ xattr -r -d com.apple.quarantine "FULL PATH OF THE QLMarkdown.app (you can drag the file to get the pull path)" - https://github.com/sbarex/QLMarkdown
# cask 'quicklook-json'
# cask 'quicklook-csv'

# Fonts
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
# mas 'Amphetamine', id: 937984704 # Prevents Mac from sleeping and more
# mas 'Magnet', id: 441258766 # Window manager
# mas 'Dropover - Easier Drag & Drop', id: 1355679052 # Drag and drop files easily
# mas 'Xcode', id: 497799835
# mas 'Unsplash Wallpapers', id: 1284863847 # App to change wallpaper from Unsplash
# mas 'Usage: System Activity Monitor', id: 1561788435 # System monitor in the menu bar
# mas 'Flip horloge -widget numérique', id: 1181028777 # Clock widget I use for displaying the time when screen saver is on
# mas 'Pixel Widgets', id: 1532582693 # App to display widets I use for displaying the remaning time in a year
# mas 'Bears Countdown', id: 1536711520 # Countdown timer widget